{
    "text": " You should positively anticipate the onset and the offset of your mid-morning resistance exercise session. Think about how hard it will be at the beginning and how great you will feel after. You should also reward yourself for the entire experience, not just the execution of the habit itself. Finally, you should mentally walk through the series of steps required to perform the habit.",
    "sourceDocuments": [
        {
            "pageContent": "exercise mid-morning. This is actually an issue for me. I much prefer to do resistance exercise than cardiovascular exercise, although once I do it, I\r\nalways feel much better that I've done it. What I should do is positively\r\nanticipate the onset and the offset of that session. Right? So thinking about leaning into the effort, going out and doing that\r\nzone II cardio session, and I should think about\r\nhow I'm going to feel after. So, not just thinking about how great I'm going to feel after, but also thinking about\r\nhow hard it's going to be at the beginning, and then trying to reward\r\nmyself subjectively for the entire experience. In other words, start\r\nrewarding task-bracketing in addition to rewarding the\r\nexecution of the habit itself. Now some of you might be saying, \"Well, wait this is all self-talk.\" \"This is just positive self-talk.\" But it's not positive self-talk,\r\nit's not saying, you know, \"I feel so great about doing something\" \"that I actually hate.\" You can't lie to yourself, or you're welcome to lie to yourself, but the neuroscience literature, the literature of growth mindset, all the literature basically of mindset speaks to the fact that\r\nwhen you lie to yourself, you know you're lying, and you actually set up the\r\nopposite of a reward system. So, you have to be brutally\r\nhonest with yourself that, for instance, \"I don't like initiating\r\nthis cardiovascular exercise\" \"but I do like the fact that I've done it\" \"after I've done it.\" So what you are doing is you are applying reward prediction error to the entire sequence of things that's involved in getting\r\ninto the habit execution, getting through the habit execution, and getting out of the habit of execution. How do you do this? Well, I take us back to our procedural memory\r\nvisualization exercises we talked about earlier. When I talked about it in that context, I talked about walking through\r\nmentally the series of steps that's required to perform\r\na particular habit. So in the case of the zone",
            "metadata": {
                "id": "Wcs2PFz5q6g",
                "loc.lines.from": 761,
                "loc.lines.to": 778,
                "source": "https://www.youtube.com/watch?v=Wcs2PFz5q6g&ab_channel=AndrewHuberman",
                "thumbnails.default.height": 90,
                "thumbnails.default.url": "https://i.ytimg.com/vi/Wcs2PFz5q6g/default.jpg",
                "thumbnails.default.width": 120,
                "thumbnails.high.height": 360,
                "thumbnails.high.url": "https://i.ytimg.com/vi/Wcs2PFz5q6g/hqdefault.jpg",
                "thumbnails.high.width": 480,
                "thumbnails.maxres.height": 720,
                "thumbnails.maxres.url": "https://i.ytimg.com/vi/Wcs2PFz5q6g/maxresdefault.jpg",
                "thumbnails.maxres.width": 1280,
                "thumbnails.medium.height": 180,
                "thumbnails.medium.url": "https://i.ytimg.com/vi/Wcs2PFz5q6g/mqdefault.jpg",
                "thumbnails.medium.width": 320,
                "thumbnails.standard.height": 480,
                "thumbnails.standard.url": "https://i.ytimg.com/vi/Wcs2PFz5q6g/sddefault.jpg",
                "thumbnails.standard.width": 640,
                "title": "The Science of Making & Breaking Habits | Huberman Lab Podcast #53"
            }
        }
    ]
}